In [210]:
import pandas as pd
import numpy as np

In [211]:
pd.__version__

'2.3.3'

In [212]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [213]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [214]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [215]:
obj2=pd.Series([4,7,-5,3], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [216]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [217]:
obj2['c']

np.int64(-5)

In [218]:
obj2["b"]=45

In [219]:
obj2

a     4
b    45
c    -5
d     3
dtype: int64

In [220]:
obj2[["b", "c", "d"]]

b    45
c    -5
d     3
dtype: int64

In [221]:
np.exp(obj2)

a    5.459815e+01
b    3.493427e+19
c    6.737947e-03
d    2.008554e+01
dtype: float64

In [222]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [223]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [224]:
states=["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [225]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [226]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [227]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [228]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [229]:
obj4.name = "population"
obj4.index.name="state"

In [230]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [231]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [232]:
obj.index=["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# Data Frame

In [233]:
data={"State":["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
      "Year":[2000, 2001, 2002, 2001, 2002, 2003],
      "Pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [234]:
frame.head()

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [235]:
frame.tail()

    State  Year  Pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [236]:
pd.DataFrame(data, columns=["Year", "State", "Pop"])

   Year   State  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [237]:
frame2=pd.DataFrame(data, columns=["Year", "State", "Pop", "Debt"])
frame2

   Year   State  Pop Debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [238]:
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [239]:
frame2.Year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [240]:
frame2.State

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: State, dtype: object

In [241]:
frame2.loc[1]

Year     2001
State    Ohio
Pop       1.7
Debt      NaN
Name: 1, dtype: object

In [242]:
frame2.iloc[2]

Year     2002
State    Ohio
Pop       3.6
Debt      NaN
Name: 2, dtype: object

In [243]:
frame2["Debt"] = 16.5
frame2

   Year   State  Pop  Debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [244]:
frame2["eastern"] = frame2["State"] == "Ohio"
frame2

   Year   State  Pop  Debt  eastern
0  2000    Ohio  1.5  16.5     True
1  2001    Ohio  1.7  16.5     True
2  2002    Ohio  3.6  16.5     True
3  2001  Nevada  2.4  16.5    False
4  2002  Nevada  2.9  16.5    False
5  2003  Nevada  3.2  16.5    False

In [245]:
del frame2["eastern"]
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')